#----------------------------------------------
# -*- encoding=utf-8 -*-                      #
# __author__:'xiaojie'                        #
# CreateTime:                                 #
#       2019/5/7 18:04                       #
#                                             #
#               天下风云出我辈，                 #
#               一入江湖岁月催。                 #
#               皇图霸业谈笑中，                 #
#               不胜人生一场醉。                 #
#----------------------------------------------

# https://github.com/eriklindernoren/Keras-GAN/blob/master/sgan/sgan.py
# 和上种方式的实现一样，根本没有无监督学习的部分，都是有监督学习，再加对抗网络。