#----------------------------------------------
# CreateTime:                                 #
# -*- encoding=utf-8 -*-                      #
# __author__:'xiaojie'                        #
#       2019/8/20 19:31                       #
#                                             #
#               天下风云出我辈，                 #
#               一入江湖岁月催。                 #
#               皇图霸业谈笑中，                 #
#               不胜人生一场醉。                 #
#----------------------------------------------
# https://github.com/Kyubyong/transformer