#----------------------------------------------
# -*- encoding=utf-8 -*-                      #
# __author__:'焉知飞鱼'                        #
# CreateTime:                                 #
#       2020/1/9 17:49                       #
#                                             #
#               天下风云出我辈，                 #
#               一入江湖岁月催。                 #
#               皇图霸业谈笑中，                 #
#               不胜人生一场醉。                 #
#----------------------------------------------
# 提供了近7万贷款用户的基本身份信息、消费行为、银行还款等数据信息，需要参赛者以此建立准确的风险控制模型，来预测用户是否会逾期还款
# 训练数据包括用户的基本属性user_info.txt、银行流水记录bank_detail.txt、
#   用户浏览行为browse_history.txt、信用卡账单记录bill_detail.txt、
#   放款时间loan_time.txt，以及这些顾客是否发生逾期行为的记录overdue.txt。